# Brewfile - Fish-First Package Management for macOS
# Author: Gökhan Arkan (@gokhanarkan)
# Usage: brew bundle

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# Core shell and terminal
brew "fish"              # Our main shell
brew "starship"          # Fast, beautiful prompt

# Essential command-line tools
brew "git"
brew "wget"
brew "curl"
brew "tree"
brew "htop"
brew "btop"             # Modern htop replacement
brew "jq"               # JSON processor
brew "yq"               # YAML processor

# Modern replacements for classic tools
brew "exa"              # Better ls
brew "bat"              # Better cat with syntax highlighting
brew "fd"               # Better find
brew "ripgrep"          # Better grep
brew "fzf"              # Fuzzy finder
brew "zoxide"           # Smart cd replacement
brew "tldr"             # Simplified man pages

# Development tools
brew "gh"               # GitHub CLI
brew "glab"             # GitLab CLI
brew "diff-so-fancy"    # Better git diffs
brew "git-delta"        # Even better git diffs

# Programming languages and version managers
brew "go"
brew "python@3.11"
brew "python@3.12"
brew "pyenv"
brew "fnm"              # Fast Node Manager (better than nvm)
brew "ruby"
brew "rbenv"

# Node.js ecosystem
brew "node"             # Backup Node.js installation
brew "pnpm"             # Fast, disk space efficient package manager
brew "yarn"             # Alternative package manager

# Database tools
brew "postgresql@15"
brew "redis"
brew "sqlite"

# Container and orchestration
brew "docker"
brew "docker-compose"
brew "kubernetes-cli"
brew "helm"
brew "k9s"              # Kubernetes TUI
brew "kubectx"          # Switch Kubernetes contexts

# Infrastructure as Code
brew "terraform"
brew "ansible"

# Cloud tools
brew "awscli"
brew "azure-cli"
brew "google-cloud-sdk"

# API and network tools
brew "httpie"           # Better curl for APIs
brew "grpcurl"          # gRPC curl
brew "nmap"
brew "telnet"

# File and archive tools
brew "unzip"
brew "zip"
brew "7zip"
brew "the_unarchiver"

# Security tools
brew "gnupg"
brew "openssh"
brew "openssl"
brew "1password-cli"    # 1Password CLI

# System monitoring and info
brew "neofetch"
brew "bandwhich"        # Network monitoring
brew "dust"             # Better du
brew "procs"            # Better ps

# Development utilities
brew "direnv"           # Environment variable management
brew "make"
brew "cmake"
brew "pkg-config"
brew "autoconf"
brew "automake"
brew "libtool"
brew "watch"            # Execute commands periodically

# Fish-specific tools
brew "fisher"           # Fish plugin manager (if not auto-installed)

# Applications - Terminal and Development
cask "ghostty"          # Primary terminal
cask "iterm2"           # Backup terminal

# Development IDEs and editors
cask "goland"           # Primary Go IDE
cask "visual-studio-code"
cask "cursor"           # AI-powered editor
cask "zed"              # Fast, modern editor

# Browsers for development
cask "google-chrome"
cask "firefox"
cask "arc"              # Modern browser

# Development utilities
cask "docker"           # Docker Desktop
cask "postman"          # API testing
cask "insomnia"         # Alternative API client
cask "tableplus"        # Universal database tool
cask "sequel-pro"       # MySQL GUI
cask "redis-insight"    # Redis GUI

# Productivity tools
cask "raycast"          # Powerful Spotlight replacement
cask "rectangle"        # Window management
cask "cleanmymac"       # System maintenance

# Communication
cask "slack"
cask "discord"
cask "zoom"
cask "microsoft-teams"

# File management and utilities
cask "the-unarchiver"   # Archive extraction
cask "cyberduck"        # FTP/SFTP client
cask "imageoptim"       # Image optimization

# Design and media
cask "figma"
cask "sketch"
cask "vlc"              # Media player

# Fonts for development (Nerd Fonts with icons)
cask "font-jetbrains-mono-nerd-font"      # Recommended primary font
cask "font-fira-code-nerd-font"           # Alternative with ligatures
cask "font-hack-nerd-font"                # Clean, readable
cask "font-source-code-pro"               # Adobe's open source font
cask "font-cascadia-code"                 # Microsoft's font
cask "font-meslo-lg-nerd-font"            # Great for terminals

# Security and passwords
cask "1password"        # Password manager
cask "1password-cli"    # CLI version

# Note-taking and documentation
cask "notion"
cask "obsidian"         # Knowledge management

# Mac App Store apps (requires mas-cli)
brew "mas"
# mas "Xcode", id: 497799835            # Uncomment if you need Xcode
# mas "Keynote", id: 409183694          # Presentation software
# mas "Numbers", id: 409203825          # Spreadsheet software
# mas "Pages", id: 409201541            # Word processor

# Optional advanced tools (uncomment if needed)
# brew "tmux"                           # Terminal multiplexer
# brew "nvim"                           # Neovim editor
# brew "lazygit"                        # Terminal Git UI
# brew "bottom"                         # System monitor
# brew "hyperfine"                      # Command-line benchmarking
# brew "tokei"                          # Code statistics
# brew "mdcat"                          # Markdown viewer
