# Brewfile - Fish-First Package Management for macOS
# Author: Gökhan Arkan (@gokhanarkan)
# Usage: brew bundle

# Taps (minimal - most are now built-in)
# tap "homebrew/bundle"  # No longer needed
# tap "homebrew/cask"    # No longer needed
# tap "homebrew/cask-fonts"  # Deprecated
# tap "homebrew/services"    # Deprecated

# Core shell and terminal
brew "fish"              # Our main shell
brew "starship"          # Fast, beautiful prompt

# Essential command-line tools
brew "git"
brew "wget"
brew "curl"
brew "tree"
brew "htop"
brew "btop"             # Modern htop replacement
brew "jq"               # JSON processor
brew "yq"               # YAML processor

# Modern replacements for classic tools
brew "eza"              # Better ls (exa replacement)
brew "bat"              # Better cat with syntax highlighting
brew "fd"               # Better find
brew "ripgrep"          # Better grep
brew "fzf"              # Fuzzy finder
brew "zoxide"           # Smart cd replacement
brew "tldr"             # Simplified man pages

# Development tools
brew "gh"               # GitHub CLI
brew "glab"             # GitLab CLI
brew "diff-so-fancy"    # Better git diffs
brew "git-delta"        # Even better git diffs

# Programming languages and version managers
brew "go"
brew "python@3.11"
brew "python@3.12"
brew "pyenv"
brew "fnm"              # Fast Node Manager (better than nvm)
brew "ruby"
brew "rbenv"

# Node.js ecosystem
brew "node"             # Backup Node.js installation
brew "pnpm"             # Fast, disk space efficient package manager
# brew "yarn"           # Removed: using pnpm instead

# Database tools
brew "postgresql@15"
brew "redis"
brew "sqlite"

# Container and orchestration
brew "docker"
brew "docker-compose"
brew "kubernetes-cli"
brew "helm"
brew "k9s"              # Kubernetes TUI
brew "kubectx"          # Switch Kubernetes contexts

# Infrastructure as Code
brew "terraform"
brew "ansible"

# Cloud tools
brew "awscli"
brew "azure-cli"

# API and network tools
brew "httpie"           # Better curl for APIs
brew "grpcurl"          # gRPC curl
brew "nmap"
brew "telnet"

# File and archive tools
brew "unzip"
brew "zip"
brew "7zip"

# Security tools
brew "gnupg"
brew "openssh"
brew "openssl"

# System monitoring and info
brew "neofetch"
brew "bandwhich"        # Network monitoring
brew "dust"             # Better du
brew "procs"            # Better ps

# Development utilities
brew "direnv"           # Environment variable management
brew "make"
brew "cmake"
brew "pkg-config"
brew "autoconf"
brew "automake"
brew "libtool"
brew "watch"            # Execute commands periodically

# Fish-specific tools
brew "fisher"           # Fish plugin manager (if not auto-installed)

# Applications - Terminal and Development
cask "ghostty"          # Primary terminal
cask "iterm2"           # Backup terminal

# Development IDEs and editors
cask "goland"           # Primary Go IDE
cask "visual-studio-code"
cask "cursor"           # AI-powered editor
cask "zed"              # Fast, modern editor

# Browsers for development
cask "google-chrome"

# Development utilities
cask "docker"           # Docker Desktop
cask "postman"          # API testing
cask "tableplus"        # Universal database tool
cask "redis-insight"    # Redis GUI
cask "google-cloud-sdk" # Google Cloud SDK

# Productivity tools
cask "alfred"           # Powerful Spotlight replacement
cask "cleanmymac"       # System maintenance

# Communication
cask "slack"

# File management and utilities
cask "cyberduck"        # FTP/SFTP client
cask "imageoptim"       # Image optimization

# Design and media
cask "vlc"              # Media player

# Fonts for development (Nerd Fonts with icons)
cask "font-jetbrains-mono-nerd-font"      # Recommended primary font
cask "font-fira-code-nerd-font"           # Alternative with ligatures
cask "font-hack-nerd-font"                # Clean, readable
cask "font-source-code-pro"               # Adobe's open source font
cask "font-cascadia-code"                 # Microsoft's font
cask "font-meslo-lg-nerd-font"            # Great for terminals


# Note-taking and documentation
cask "notion"

# Mac App Store apps (requires mas-cli)
brew "mas"
# mas "Xcode", id: 497799835            # Uncomment if you need Xcode
# mas "Keynote", id: 409183694          # Presentation software
# mas "Numbers", id: 409203825          # Spreadsheet software
# mas "Pages", id: 409201541            # Word processor

# AI/LLM Development Tools
brew "ollama"            # Local LLM runtime
brew "ffmpeg"            # Video/audio processing for AI
brew "imagemagick"       # Image processing
brew "pandoc"            # Document conversion
brew "jupyterlab"        # Data science notebooks
brew "graphviz"          # Graph visualization
brew "mermaid-cli"       # Diagram generation
brew "tesseract"         # OCR for text extraction
brew "whisper-cpp"       # Local speech-to-text
brew "python-tk"         # GUI toolkit for Python
# Note: scipy, numpy, matplotlib are best installed via pip in virtual environments

# AI/LLM Applications
cask "lm-studio"         # Local LLM interface
cask "chatgpt"           # Official ChatGPT app
cask "github-copilot-for-xcode"  # GitHub Copilot for Xcode

# Optional advanced tools (uncomment if needed)
brew "tmux"             # Terminal multiplexer
# brew "nvim"             # Neovim editor
# brew "lazygit"          # Terminal Git UI
# brew "bottom"           # System monitor
# brew "hyperfine"        # Command-line benchmarking
brew "tokei"            # Code statistics
# brew "mdcat"            # Markdown viewer
